wiki/2017-03-29-git-flow.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>Git Flow代码示例</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">Git Flow代码示例</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#git"><div class="category">git</div></a> </div>
<div class="char-counter">2017-03-29</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3a48152">创建develop分支</a></li>
<li><a href="#org9c0236c">开始新Feature开发</a></li>
<li><a href="#orgb3e3014">完成Feature</a></li>
<li><a href="#org9361ff2">开始Relase</a></li>
<li><a href="#orgedfdc27">完成Release</a></li>
<li><a href="#orgeadf7b2">开始Hotfix</a></li>
<li><a href="#org1ff5dac">完成Hotfix</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org3a48152" class="outline-2">
<h2 id="org3a48152">创建develop分支</h2>
<div class="outline-text-2" id="text-org3a48152">
<p class="verse">
git branch develop<br>
git push -u origin develop<br>
<br>
</p>
</div>
</div>

<div id="outline-container-org9c0236c" class="outline-2">
<h2 id="org9c0236c">开始新Feature开发</h2>
<div class="outline-text-2" id="text-org9c0236c">
<p class="verse">
git checkout -b some-feature develop<br>
# Optionally, push branch to origin:<br>
git push -u origin some-feature<br>
# 做一些改动<br>
git status<br>
git add some-file<br>
git commit<br>
</p>
</div>
</div>

<div id="outline-container-orgb3e3014" class="outline-2">
<h2 id="orgb3e3014">完成Feature</h2>
<div class="outline-text-2" id="text-orgb3e3014">
<p class="verse">
git pull origin develop<br>
git checkout develop<br>
git merge --no-ff some-feature<br>
git push origin develop<br>
git branch -d some-feature<br>
# If you pushed branch to origin:<br>
git push origin --delete some-feature<br>
<br>
</p>
</div>
</div>

<div id="outline-container-org9361ff2" class="outline-2">
<h2 id="org9361ff2">开始Relase</h2>
<div class="outline-text-2" id="text-org9361ff2">
<p class="verse">
git checkout -b release-0.1.0 develop<br>
# Optional: Bump version number, commit<br>
# Prepare release, commit<br>
<br>
</p>
</div>
</div>

<div id="outline-container-orgedfdc27" class="outline-2">
<h2 id="orgedfdc27">完成Release</h2>
<div class="outline-text-2" id="text-orgedfdc27">
<p class="verse">
git checkout master<br>
git merge --no-ff release-0.1.0<br>
git push<br>
git checkout develop<br>
git merge --no-ff release-0.1.0<br>
git push<br>
git branch -d release-0.1.0<br>
# If you pushed branch to origin:<br>
git push origin --delete release-0.1.0<br>
git tag -a v0.1.0 master<br>
git push --tags<br>
<br>
</p>
</div>
</div>

<div id="outline-container-orgeadf7b2" class="outline-2">
<h2 id="orgeadf7b2">开始Hotfix</h2>
<div class="outline-text-2" id="text-orgeadf7b2">
<pre class="example">
git checkout -b hotfix-0.1.1 master

</pre>
</div>
</div>

<div id="outline-container-org1ff5dac" class="outline-2">
<h2 id="org1ff5dac">完成Hotfix</h2>
<div class="outline-text-2" id="text-org1ff5dac">
<p class="verse">
git checkout master<br>
git merge --no-ff hotfix-0.1.1<br>
git push<br>
git checkout develop<br>
git merge --no-ff hotfix-0.1.1<br>
git push<br>
git branch -d hotfix-0.1.1<br>
git tag -a v0.1.1 master<br>
git push --tags<br>
<br>
</p>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
